GopalSaraf/Practicals/PSDL/include/proc/pic18lf24j50.inc
// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_AN12_POSN                          equ 0000h
PORTB_AN12_POSITION                      equ 0000h
PORTB_AN12_SIZE                          equ 0001h
PORTB_AN12_LENGTH                        equ 0001h
PORTB_AN12_MASK                          equ 0001h
PORTB_AN10_POSN                          equ 0001h
PORTB_AN10_POSITION                      equ 0001h
PORTB_AN10_SIZE                          equ 0001h
PORTB_AN10_LENGTH                        equ 0001h
PORTB_AN10_MASK                          equ 0002h
PORTB_AN8_POSN                           equ 0002h
PORTB_AN8_POSITION                       equ 0002h
PORTB_AN8_SIZE                           equ 0001h
PORTB_AN8_LENGTH                         equ 0001h
PORTB_AN8_MASK                           equ 0004h
PORTB_AN9_POSN                           equ 0003h
PORTB_AN9_POSITION                       equ 0003h
PORTB_AN9_SIZE                           equ 0001h
PORTB_AN9_LENGTH                         equ 0001h
PORTB_AN9_MASK                           equ 0008h
PORTB_KBI2_POSN                          equ 0006h
PORTB_KBI2_POSITION                      equ 0006h
PORTB_KBI2_SIZE                          equ 0001h
PORTB_KBI2_LENGTH                        equ 0001h
PORTB_KBI2_MASK                          equ 0040h
PORTB_KBI3_POSN                          equ 0007h
PORTB_KBI3_POSITION                      equ 0007h
PORTB_KBI3_SIZE                          equ 0001h
PORTB_KBI3_LENGTH                        equ 0001h
PORTB_KBI3_MASK                          equ 0080h
PORTB_INT0_POSN                          equ 0000h
PORTB_INT0_POSITION                      equ 0000h
PORTB_INT0_SIZE                          equ 0001h
PORTB_INT0_LENGTH                        equ 0001h
PORTB_INT0_MASK                          equ 0001h
PORTB_CTEDG1_POSN                        equ 0002h
PORTB_CTEDG1_POSITION                    equ 0002h
PORTB_CTEDG1_SIZE                        equ 0001h
PORTB_CTEDG1_LENGTH                      equ 0001h
PORTB_CTEDG1_MASK                        equ 0004h
PORTB_CTEDG2_POSN                        equ 0003h
PORTB_CTEDG2_POSITION                    equ 0003h
PORTB_CTEDG2_SIZE                        equ 0001h
PORTB_CTEDG2_LENGTH                      equ 0001h
PORTB_CTEDG2_MASK                        equ 0008h
PORTB_KBI0_POSN                          equ 0004h
PORTB_KBI0_POSITION                      equ 0004h
PORTB_KBI0_SIZE                          equ 0001h
PORTB_KBI0_LENGTH                        equ 0001h
PORTB_KBI0_MASK                          equ 0010h
PORTB_KBI1_POSN                          equ 0005h
PORTB_KBI1_POSITION                      equ 0005h
PORTB_KBI1_SIZE                          equ 0001h
PORTB_KBI1_LENGTH                        equ 0001h
PORTB_KBI1_MASK                          equ 0020h
PORTB_PGC_POSN                           equ 0006h
PORTB_PGC_POSITION                       equ 0006h
PORTB_PGC_SIZE                           equ 0001h
PORTB_PGC_LENGTH                         equ 0001h
PORTB_PGC_MASK                           equ 0040h
PORTB_PGD_POSN                           equ 0007h
PORTB_PGD_POSITION                       equ 0007h
PORTB_PGD_SIZE                           equ 0001h
PORTB_PGD_LENGTH                         equ 0001h
PORTB_PGD_MASK                           equ 0080h
PORTB_RP3_POSN                           equ 0000h
PORTB_RP3_POSITION                       equ 0000h
PORTB_RP3_SIZE                           equ 0001h
PORTB_RP3_LENGTH                         equ 0001h
PORTB_RP3_MASK                           equ 0001h
PORTB_RTCC_POSN                          equ 0001h
PORTB_RTCC_POSITION                      equ 0001h
PORTB_RTCC_SIZE                          equ 0001h
PORTB_RTCC_LENGTH                        equ 0001h
PORTB_RTCC_MASK                          equ 0002h
PORTB_SCK1_POSN                          equ 0004h
PORTB_SCK1_POSITION                      equ 0004h
PORTB_SCK1_SIZE                          equ 0001h
PORTB_SCK1_LENGTH                        equ 0001h
PORTB_SCK1_MASK                          equ 0010h
PORTB_SDI1_POSN                          equ 0005h
PORTB_SDI1_POSITION                      equ 0005h
PORTB_SDI1_SIZE                          equ 0001h
PORTB_SDI1_LENGTH                        equ 0001h
PORTB_SDI1_MASK                          equ 0020h
PORTB_RP9_POSN                           equ 0006h
PORTB_RP9_POSITION                       equ 0006h
PORTB_RP9_SIZE                           equ 0001h
PORTB_RP9_LENGTH                         equ 0001h
PORTB_RP9_MASK                           equ 0040h
PORTB_RP10_POSN                          equ 0007h
PORTB_RP10_POSITION                      equ 0007h
PORTB_RP10_SIZE                          equ 0001h
PORTB_RP10_LENGTH                        equ 0001h
PORTB_RP10_MASK                          equ 0080h
PORTB_RP4_POSN                           equ 0001h
PORTB_RP4_POSITION                       equ 0001h
PORTB_RP4_SIZE                           equ 0001h
PORTB_RP4_LENGTH                         equ 0001h
PORTB_RP4_MASK                           equ 0002h
PORTB_VMO_POSN                           equ 0002h
PORTB_VMO_POSITION                       equ 0002h
PORTB_VMO_SIZE                           equ 0001h
PORTB_VMO_LENGTH                         equ 0001h
PORTB_VMO_MASK                           equ 0004h
PORTB_VPO_POSN                           equ 0003h
PORTB_VPO_POSITION                       equ 0003h
PORTB_VPO_SIZE                           equ 0001h
PORTB_VPO_LENGTH                         equ 0001h
PORTB_VPO_MASK                           equ 0008h
PORTB_SCL1_POSN                          equ 0004h
PORTB_SCL1_POSITION                      equ 0004h
PORTB_SCL1_SIZE                          equ 0001h
PORTB_SCL1_LENGTH                        equ 0001h
PORTB_SCL1_MASK                          equ 0010h
PORTB_SDA1_POSN                          equ 0005h
PORTB_SDA1_POSITION                      equ 0005h
PORTB_SDA1_SIZE                          equ 0001h
PORTB_SDA1_LENGTH                        equ 0001h
PORTB_SDA1_MASK                          equ 0020h
PORTB_REFO_POSN                          equ 0002h
PORTB_REFO_POSITION                      equ 0002h
PORTB_REFO_SIZE                          equ 0001h
PORTB_REFO_LENGTH                        equ 0001h
PORTB_REFO_MASK                          equ 0004h
PORTB_RP6_POSN                           equ 0003h
PORTB_RP6_POSITION                       equ 0003h
PORTB_RP6_SIZE                           equ 0001h
PORTB_RP6_LENGTH                         equ 0001h
PORTB_RP6_MASK                           equ 0008h
PORTB_RP7_POSN                           equ 0004h
PORTB_RP7_POSITION                       equ 0004h
PORTB_RP7_SIZE                           equ 0001h
PORTB_RP7_LENGTH                         equ 0001h
PORTB_RP7_MASK                           equ 0010h
PORTB_RP8_POSN                           equ 0005h
PORTB_RP8_POSITION                       equ 0005h
PORTB_RP8_SIZE                           equ 0001h
PORTB_RP8_LENGTH                         equ 0001h
PORTB_RP8_MASK                           equ 0020h
PORTB_RP5_POSN                           equ 0002h
PORTB_RP5_POSITION                       equ 0002h
PORTB_RP5_SIZE                           equ 0001h
PORTB_RP5_LENGTH                         equ 0001h
PORTB_RP5_MASK                           equ 0004h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_T1OSO_POSN                         equ 0000h
PORTC_T1OSO_POSITION                     equ 0000h
PORTC_T1OSO_SIZE                         equ 0001h
PORTC_T1OSO_LENGTH                       equ 0001h
PORTC_T1OSO_MASK                         equ 0001h
PORTC_T1OSI_POSN                         equ 0001h
PORTC_T1OSI_POSITION                     equ 0001h
PORTC_T1OSI_SIZE                         equ 0001h
PORTC_T1OSI_LENGTH                       equ 0001h
PORTC_T1OSI_MASK                         equ 0002h
PORTC_AN11_POSN                          equ 0002h
PORTC_AN11_POSITION                      equ 0002h
PORTC_AN11_SIZE                          equ 0001h
PORTC_AN11_LENGTH                        equ 0001h
PORTC_AN11_MASK                          equ 0004h
PORTC_D_MINUS_POSN                       equ 0004h
PORTC_D_MINUS_POSITION                   equ 0004h
PORTC_D_MINUS_SIZE                       equ 0001h
PORTC_D_MINUS_LENGTH                     equ 0001h
PORTC_D_MINUS_MASK                       equ 0010h
PORTC_D_PLUS_POSN                        equ 0005h
PORTC_D_PLUS_POSITION                    equ 0005h
PORTC_D_PLUS_SIZE                        equ 0001h
PORTC_D_PLUS_LENGTH                      equ 0001h
PORTC_D_PLUS_MASK                        equ 0020h
PORTC_NOT_UOE_POSN                       equ 0001h
PORTC_NOT_UOE_POSITION                   equ 0001h
PORTC_NOT_UOE_SIZE                       equ 0001h
PORTC_NOT_UOE_LENGTH                     equ 0001h
PORTC_NOT_UOE_MASK                       equ 0002h
PORTC_T1CK_POSN                          equ 0000h
PORTC_T1CK_POSITION                      equ 0000h
PORTC_T1CK_SIZE                          equ 0001h
PORTC_T1CK_LENGTH                        equ 0001h
PORTC_T1CK_MASK                          equ 0001h
PORTC_nUOE_POSN                          equ 0001h
PORTC_nUOE_POSITION                      equ 0001h
PORTC_nUOE_SIZE                          equ 0001h
PORTC_nUOE_LENGTH                        equ 0001h
PORTC_nUOE_MASK                          equ 0002h
PORTC_CTPLS_POSN                         equ 0002h
PORTC_CTPLS_POSITION                     equ 0002h
PORTC_CTPLS_SIZE                         equ 0001h
PORTC_CTPLS_LENGTH                       equ 0001h
PORTC_CTPLS_MASK                         equ 0004h
PORTC_VM_POSN                            equ 0004h
PORTC_VM_POSITION                        equ 0004h
PORTC_VM_SIZE                            equ 0001h
PORTC_VM_LENGTH                          equ 0001h
PORTC_VM_MASK                            equ 0010h
PORTC_VP_POSN                            equ 0005h
PORTC_VP_POSITION                        equ 0005h
PORTC_VP_SIZE                            equ 0001h
PORTC_VP_LENGTH                          equ 0001h
PORTC_VP_MASK                            equ 0020h
PORTC_TX1_POSN                           equ 0006h
PORTC_TX1_POSITION                       equ 0006h
PORTC_TX1_SIZE                           equ 0001h
PORTC_TX1_LENGTH                         equ 0001h
PORTC_TX1_MASK                           equ 0040h
PORTC_RX1_POSN                           equ 0007h
PORTC_RX1_POSITION                       equ 0007h
PORTC_RX1_SIZE                           equ 0001h
PORTC_RX1_LENGTH                         equ 0001h
PORTC_RX1_MASK                           equ 0080h
PORTC_RP11_POSN                          equ 0000h
PORTC_RP11_POSITION                      equ 0000h
PORTC_RP11_SIZE                          equ 0001h
PORTC_RP11_LENGTH                        equ 0001h
PORTC_RP11_MASK                          equ 0001h
PORTC_RP12_POSN                          equ 0001h
PORTC_RP12_POSITION                      equ 0001h
PORTC_RP12_SIZE                          equ 0001h
PORTC_RP12_LENGTH                        equ 0001h
PORTC_RP12_MASK                          equ 0002h
PORTC_RP13_POSN                          equ 0002h
PORTC_RP13_POSITION                      equ 0002h
PORTC_RP13_SIZE                          equ 0001h
PORTC_RP13_LENGTH                        equ 0001h
PORTC_RP13_MASK                          equ 0004h
PORTC_CK1_POSN                           equ 0006h
PORTC_CK1_POSITION                       equ 0006h
PORTC_CK1_SIZE                           equ 0001h
PORTC_CK1_LENGTH                         equ 0001h
PORTC_CK1_MASK                           equ 0040h
PORTC_DT1_POSN                           equ 0007h
PORTC_DT1_POSITION                       equ 0007h
PORTC_DT1_SIZE                           equ 0001h
PORTC_DT1_LENGTH                         equ 0001h
PORTC_DT1_MASK                           equ 0080h
PORTC_RP17_POSN                          equ 0006h
PORTC_RP17_POSITION                      equ 0006h
PORTC_RP17_SIZE                          equ 0001h
PORTC_RP17_LENGTH                        equ 0001h
PORTC_RP17_MASK                          equ 0040h
PORTC_SDO1_POSN                          equ 0007h
PORTC_SDO1_POSITION                      equ 0007h
PORTC_SDO1_SIZE                          equ 0001h
PORTC_SDO1_LENGTH                        equ 0001h
PORTC_SDO1_MASK                          equ 0080h
PORTC_RP18_POSN                          equ 0007h
PORTC_RP18_POSITION                      equ 0007h
PORTC_RP18_SIZE                          equ 0001h
PORTC_RP18_LENGTH                        equ 0001h
PORTC_RP18_MASK                          equ 0080h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h

// Register: HLVDCON
#define HLVDCON HLVDCON
HLVDCON                                  equ 0F85h
// bitfield definitions
HLVDCON_HLVDL_POSN                       equ 0000h
HLVDCON_HLVDL_POSITION                   equ 0000h
HLVDCON_HLVDL_SIZE                       equ 0004h
HLVDCON_HLVDL_LENGTH                     equ 0004h
HLVDCON_HLVDL_MASK                       equ 000Fh
HLVDCON_HLVDEN_POSN                      equ 0004h
HLVDCON_HLVDEN_POSITION                  equ 0004h
HLVDCON_HLVDEN_SIZE                      equ 0001h
HLVDCON_HLVDEN_LENGTH                    equ 0001h
HLVDCON_HLVDEN_MASK                      equ 0010h
HLVDCON_IRVST_POSN                       equ 0005h
HLVDCON_IRVST_POSITION                   equ 0005h
HLVDCON_IRVST_SIZE                       equ 0001h
HLVDCON_IRVST_LENGTH                     equ 0001h
HLVDCON_IRVST_MASK                       equ 0020h
HLVDCON_BGVST_POSN                       equ 0006h
HLVDCON_BGVST_POSITION                   equ 0006h
HLVDCON_BGVST_SIZE                       equ 0001h
HLVDCON_BGVST_LENGTH                     equ 0001h
HLVDCON_BGVST_MASK                       equ 0040h
HLVDCON_VDIRMAG_POSN                     equ 0007h
HLVDCON_VDIRMAG_POSITION                 equ 0007h
HLVDCON_VDIRMAG_SIZE                     equ 0001h
HLVDCON_VDIRMAG_LENGTH                   equ 0001h
HLVDCON_VDIRMAG_MASK                     equ 0080h
HLVDCON_HLVDL0_POSN                      equ 0000h
HLVDCON_HLVDL0_POSITION                  equ 0000h
HLVDCON_HLVDL0_SIZE                      equ 0001h
HLVDCON_HLVDL0_LENGTH                    equ 0001h
HLVDCON_HLVDL0_MASK                      equ 0001h
HLVDCON_HLVDL1_POSN                      equ 0001h
HLVDCON_HLVDL1_POSITION                  equ 0001h
HLVDCON_HLVDL1_SIZE                      equ 0001h
HLVDCON_HLVDL1_LENGTH                    equ 0001h
HLVDCON_HLVDL1_MASK                      equ 0002h
HLVDCON_HLVDL2_POSN                      equ 0002h
HLVDCON_HLVDL2_POSITION                  equ 0002h
HLVDCON_HLVDL2_SIZE                      equ 0001h
HLVDCON_HLVDL2_LENGTH                    equ 0001h
HLVDCON_HLVDL2_MASK                      equ 0004h
HLVDCON_HLVDL3_POSN                      equ 0003h
HLVDCON_HLVDL3_POSITION                  equ 0003h
HLVDCON_HLVDL3_SIZE                      equ 0001h
HLVDCON_HLVDL3_LENGTH                    equ 0001h
HLVDCON_HLVDL3_MASK                      equ 0008h

// Register: DMACON2
#define DMACON2 DMACON2
DMACON2                                  equ 0F86h
// bitfield definitions
DMACON2_INTLVL_POSN                      equ 0000h
DMACON2_INTLVL_POSITION                  equ 0000h
DMACON2_INTLVL_SIZE                      equ 0004h
DMACON2_INTLVL_LENGTH                    equ 0004h
DMACON2_INTLVL_MASK                      equ 000Fh
DMACON2_DLYCYC_POSN                      equ 0004h
DMACON2_DLYCYC_POSITION                  equ 0004h
DMACON2_DLYCYC_SIZE                      equ 0004h
DMACON2_DLYCYC_LENGTH                    equ 0004h
DMACON2_DLYCYC_MASK                      equ 00F0h
DMACON2_INTLVL0_POSN                     equ 0000h
DMACON2_INTLVL0_POSITION                 equ 0000h
DMACON2_INTLVL0_SIZE                     equ 0001h
DMACON2_INTLVL0_LENGTH                   equ 0001h
DMACON2_INTLVL0_MASK                     equ 0001h
DMACON2_INTLVL1_POSN                     equ 0001h
DMACON2_INTLVL1_POSITION                 equ 0001h
DMACON2_INTLVL1_SIZE                     equ 0001h
DMACON2_INTLVL1_LENGTH                   equ 0001h
DMACON2_INTLVL1_MASK                     equ 0002h
DMACON2_INTLVL2_POSN                     equ 0002h
DMACON2_INTLVL2_POSITION                 equ 0002h
DMACON2_INTLVL2_SIZE                     equ 0001h
DMACON2_INTLVL2_LENGTH                   equ 0001h
DMACON2_INTLVL2_MASK                     equ 0004h
DMACON2_INTLVL3_POSN                     equ 0003h
DMACON2_INTLVL3_POSITION                 equ 0003h
DMACON2_INTLVL3_SIZE                     equ 0001h
DMACON2_INTLVL3_LENGTH                   equ 0001h
DMACON2_INTLVL3_MASK                     equ 0008h
DMACON2_DLYCYC0_POSN                     equ 0004h
DMACON2_DLYCYC0_POSITION                 equ 0004h
DMACON2_DLYCYC0_SIZE                     equ 0001h
DMACON2_DLYCYC0_LENGTH                   equ 0001h
DMACON2_DLYCYC0_MASK                     equ 0010h
DMACON2_DLYCYC1_POSN                     equ 0005h
DMACON2_DLYCYC1_POSITION                 equ 0005h
DMACON2_DLYCYC1_SIZE                     equ 0001h
DMACON2_DLYCYC1_LENGTH                   equ 0001h
DMACON2_DLYCYC1_MASK                     equ 0020h
DMACON2_DLYCYC2_POSN                     equ 0006h
DMACON2_DLYCYC2_POSITION                 equ 0006h
DMACON2_DLYCYC2_SIZE                     equ 0001h
DMACON2_DLYCYC2_LENGTH                   equ 0001h
DMACON2_DLYCYC2_MASK                     equ 0040h
DMACON2_DLYCYC3_POSN                     equ 0007h
DMACON2_DLYCYC3_POSITION                 equ 0007h
DMACON2_DLYCYC3_SIZE                     equ 0001h
DMACON2_DLYCYC3_LENGTH                   equ 0001h
DMACON2_DLYCYC3_MASK                     equ 0080h

